Repository: pingfangx/TranslatorX-other
Catalog: JavaDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: In which case, most methods, when called with an Inet6Address will throw an Exception.
zh_cn: 在此情况下，大多数方法在使用 Inet6Address 调用时都将抛出异常。

source: Index values refer to char code units, so a supplementary character uses two positions in a String.
zh_cn: 索引值是指 char 代码单元，因此增补字符在 String 中占用两个位置。

source: Indicates how long annotations with the annotated type are to be retained.
zh_cn: 指示注释类型的注释要保留多久。

source: Indicates that a method declaration is intended to override a method declaration in a supertype.
zh_cn: 表示一个方法声明打算重写超类中的另一个方法声明。

source: Indicates that an annotation type is automatically inherited.
zh_cn: 指示注释类型被自动继承。

source: Indicates that annotations with a type are to be documented by javadoc and similar tools by default.
zh_cn: 指示某一类型的注释将通过 javadoc 和类似的默认工具进行文档化。

source: Indicates that one or more deserialized objects failed validation tests.
zh_cn: 指示一个或多个反序列化对象未通过验证测试。

source: Indicates that the named compiler warnings should be suppressed in the annotated element (and in all program elements contained in the annotated element).
zh_cn: 指示应该在注释元素（以及包含在该注释元素中的所有程序元素）中取消显示指定的编译器警告。

source: Indicates the kinds of program element to which an annotation type is applicable.
zh_cn: 指示注释类型所适用的程序元素的种类。

source: Indicates whether some other object is "equal to" this one.
zh_cn: 指示其他某个对象是否与此对象“相等”。

source: Informally, with a 1 ulp error bound, when the exact result is a representable number, the exact result should be returned as the computed result; otherwise, either of the two floating-point values which bracket the exact result may be returned.
zh_cn: 非正式地，对于 1 ulp 的误差范围，当准确结果是可表示的数值时，应该按照计算结果返回准确结果；否则，返回包括准确结果的两个浮点值中的一个。

source: Inheritable thread-local variables are used in preference to ordinary thread-local variables when the per-thread-attribute being maintained in the variable (e.g., User ID, Transaction ID) must be automatically transmitted to any child threads that are created.
zh_cn: 当必须将变量（如用户 ID 和 事务 ID）中维护的每线程属性（per-thread-attribute）自动传送给创建的所有子线程时，应尽可能地采用可继承的线程局部变量，而不是采用普通的线程局部变量。

source: Inherited members are not included.
zh_cn: 不包括继承成员。

source: Initializes a newly created String object so that it represents an empty character sequence.
zh_cn: 初始化一个新创建的 String 对象，使其表示一个空字符序列。

source: Initializes a newly created String object so that it represents the same sequence of characters as the argument; in other words, the newly created string is a copy of the argument string.
zh_cn: 初始化一个新创建的 String 对象，使其表示一个与参数相同的字符序列；换句话说，新创建的字符串是该参数字符串的副本。

source: Initializes or doubles table size.
zh_cn: 初始化或加倍表的大小。

source: Initializes the cause of this throwable to the specified value.
zh_cn: 将此抛出对象的原因 初始化为指定值。

source: Initiates an orderly shutdown in which previously submitted tasks are executed, but no new tasks will be accepted.
zh_cn: 按过去执行已提交任务的顺序发起一个有序的关闭，但是不接受新任务。

source: Inserts a subsequence of the specified CharSequence into this sequence.
zh_cn: 将指定 CharSequence 的子序列插入到此序列。

source: Inserts the specified CharSequence into this sequence.
zh_cn: 将指定 CharSequence 插入此序列中。

source: Inserts the string into this character sequence.
zh_cn: 将字符串插入此字符序列中。

source: Inserts the string representation of a subarray of the str array argument into this sequence.
zh_cn: 将 str 数组参数的子数组的字符串表示形式插入此序列中。

source: Inserts the string representation of the Object argument into this character sequence.
zh_cn: 将 Object 参数的字符串表示形式插入此字符序列中。

source: Inserts the string representation of the boolean argument into this sequence.
zh_cn: 将 boolean 参数的字符串表示形式插入此序列中。

source: Inserts the string representation of the char argument into this sequence.
zh_cn: 将 char 参数的字符串表示形式插入此序列中。

source: Inserts the string representation of the char array argument into this sequence.
zh_cn: 将 char 数组参数的字符串表示形式插入此序列中。

source: Inserts the string representation of the double argument into this sequence.
zh_cn: 将 double 参数的字符串表示形式插入此序列中。

source: Inserts the string representation of the float argument into this sequence.
zh_cn: 将 float 参数的字符串表示形式插入此序列中。

source: Inserts the string representation of the long argument into this sequence.
zh_cn: 将 long 参数的字符串表示形式插入此序列中。

source: Inserts the string representation of the second int argument into this sequence.
zh_cn: 将 int 参数的字符串表示形式插入此序列中。

source: Instances of StringBuilder are not safe for use by multiple threads.
zh_cn: 将 StringBuilder 的实例用于多个线程是不安全的。

source: Instances of classes AtomicBoolean, AtomicInteger, AtomicLong, and AtomicReference each provide access and updates to a single variable of the corresponding type.
zh_cn: 类 AtomicBoolean、AtomicInteger、AtomicLong 和 AtomicReference 的实例各自提供对相应类型单个变量的访问和更新。

source: Instances of classes that implement this interface are used to filter filenames.
zh_cn: 实现此接口的类实例可用于过滤器文件名。

source: Instances of classes that implement this interface must implement an equals() method that equates any two instances that share the same generic type declaration and have equal type parameters.
zh_cn: 实现此接口的类的实例必须实现 equals() 方法，该方法用于比较两个共享相同一般类型声明和具有相同类型参数的任何实例。

source: Instances of the class Class represent classes and interfaces in a running Java application.
zh_cn: Class 类的实例表示正在运行的 Java 应用程序中的类和接口。

source: Instances of the file descriptor class serve as an opaque handle to the underlying machine-specific structure representing an open file, an open socket, or another source or sink of bytes.
zh_cn: 文件描述符类的实例用作与基础机器有关的某种结构的不透明句柄，该结构表示开放文件、开放套接字或者字节的另一个源或接收者。

source: Instances of this class represent particular subsets of the Unicode character set.
zh_cn: 此类的实例表示 Unicode 字符集的特定子集。

source: Instances of this class support both reading and writing to a random access file.
zh_cn: 此类的实例支持对随机访问文件的读取和写入。

source: Instances of this newly defined class can be created using Class.newInstance.
zh_cn: 这种新定义的类的实例可以使用 Class.newInstance 来创建。

source: Instances of two subclasses, Error and Exception, are conventionally used to indicate that exceptional situations have occurred.
zh_cn: 两个子类的实例，Error 和 Exception，通常用于指示发生了异常情况。

source: Instead Class objects are constructed automatically by the Java Virtual Machine as classes are loaded and by calls to the defineClass method in the class loader.
zh_cn: Class 对象是在加载类时由 Java 虚拟机以及通过调用类加载器中的 defineClass 方法自动构造的。

source: Instead, for the Math class, a larger error bound of 1 or 2 ulps is allowed for certain methods.
zh_cn: 相反，对于 Math 类，某些方法允许误差在 1 或 2 ulp 的范围内。

source: Interface for extending managed parallelism for tasks running in ForkJoinPools.
zh_cn: 用于扩展在 ForkJoinPool 中运行的任务的托管并行性的接口。

source: Interface for handlers invoked when a Thread abruptly terminates due to an uncaught exception.
zh_cn: 当 Thread 因未捕获的异常而突然终止时，调用处理程序的接口。

source: Interface of methods to get/set socket options.
zh_cn: 获取/设置套接字选项的方法的接口。

source: Interfaces
zh_cn: 接口

source: Interfaces and classes providing a framework for locking and waiting for conditions that is distinct from built-in synchronization and monitors.
zh_cn: 为锁和等待条件提供一个框架的接口和类，它不同于内置同步和监视器。

source: Interrupts all threads in this thread group.
zh_cn: 中断此线程组中的所有线程。

source: Interrupts this thread.
zh_cn: 中断线程。

source: InvocationTargetException is a checked exception that wraps an exception thrown by an invoked method or constructor.
zh_cn: InvocationTargetException 是一种包装由调用方法或构造方法所抛出异常的经过检查的异常。

source: Invokes shutdown when this executor is no longer referenced and it has no threads.
zh_cn: 当不再引用此执行程序并且没有线程时，调用 shutdown。

source: Invokes the underlying method represented by this Method object, on the specified object with the specified parameters.
zh_cn: 对带有指定参数的指定对象调用由此 Method 对象表示的底层方法。

source: Invoking Object's clone method on an instance that does not implement the Cloneable interface results in the exception CloneNotSupportedException being thrown.
zh_cn: 如果在没有实现 Cloneable 接口的实例上调用 Object 的 clone 方法，则会导致抛出 CloneNotSupportedException 异常。

source: Invoking this method is equivalent to creating an array as follows:
zh_cn: 调用此方法等效于如下创建一个数组：

source: Invoking this method will not cause this object to be enqueued.
zh_cn: 调用此方法不会导致对象被加入队列。

source: It applies only when critical updates for an object are confined to a single variable.
zh_cn: 仅当对象的重要更新限定于单个 变量时才应用它。

source: It can also contain a message string that gives more information about the error.
zh_cn: 它还包含了给出有关错误更多信息的消息字符串。

source: It can only be used on annotation type declarations:
zh_cn: 它只能用在注释类型声明上：

source: It cannot be instantiated.
zh_cn: 它不能被实例化。

source: It cannot be used to annotate anything directly:
zh_cn: 它不能直接用于注释：

source: It does not support the add or addAll operations.
zh_cn: 它不支持 add 或 addAll 操作。

source: It follows immediately from the contract for compareTo that the quotient is an equivalence relation on C, and that the natural ordering is a total order on C.
zh_cn: 紧接着从 compareTo 的合同开始，商是 C 上的 equivalence relation (等价关系)，自然顺序是 C 上的 total order (总顺序)。

source: It has no effect if the meta-annotated type is used as a member type in another annotation type.
zh_cn: 如果元注释类型用作另一种注释类型的成员，则无效。

source: It has two subclasses:
zh_cn: 它拥有两个子类：

source: It is not required that if two objects are unequal according to the equals(java.lang.Object) method, then calling the hashCode method on each of the two objects must produce distinct integer results.
zh_cn: 如果根据 equals(java.lang.Object) 方法，两个对象不相等，那么对这两个对象中的任一对象上调用 hashCode 方法不 要求一定生成不同的整数结果。

source: It is consistent: for any non-null reference values x and y, multiple invocations of x.equals(y) consistently return true or consistently return false, provided no information used in equals comparisons on the objects is modified.
zh_cn: 一致性：对于任何非空引用值 x 和 y，多次调用 x.equals(y) 始终返回 true 或始终返回 false，前提是对象上 equals 比较中所用的信息没有被修改。

source: It is reflexive: for any non-null reference value x, x.equals(x) should return true.
zh_cn: 自反性：对于任何非空引用值 x，x.equals(x) 都应返回 true。

source: It is symmetric: for any non-null reference values x and y, x.equals(y) should return true if and only if y.equals(x) returns true.
zh_cn: 对称性：对于任何非空引用值 x 和 y，当且仅当 y.equals(x) 返回 true 时，x.equals(y) 才应返回 true。

source: It is transitive: for any non-null reference values x, y, and z, if x.equals(y) returns true and y.equals(z) returns true, then x.equals(z) should return true.
zh_cn: 传递性：对于任何非空引用值 x、y 和 z，如果 x.equals(y) 返回 true，并且 y.equals(z) 返回 true，那么 x.equals(z) 应返回 true。

source: It is a compile-time error for a single ElementType constant to appear more than once in a Target annotation.
zh_cn: 这是一个编译时错误，它表明一个 ElementType 常量在 Target 注释中出现了不只一次。

source: It is also possible to get the Class object for a named type (or for void) using a class literal.
zh_cn: 还可以使用一个类字面值来获取指定类型（或 void）的 Class 对象。

source: It is designed for use by sophisticated enum-based data structures, such as EnumSet and EnumMap.
zh_cn: 它被设计用于复杂的基于枚举的数据结构，比如 EnumSet 和 EnumMap。

source: It is for use by code emitted by the compiler in response to enum type declarations.
zh_cn: 它由编译器发出的代码用于响应枚举类型声明。

source: It is guaranteed, however, that the thread that invokes finalize will not be holding any user-visible synchronization locks when finalize is invoked.
zh_cn: 但可以保证在调用 finalize 时，调用 finalize 的线程将不会持有任何用户可见的同步锁定。

source: It is never legal to start a thread more than once.
zh_cn: 多次启动一个线程是非法的。

source: It is not checked whether command corresponds to a valid operating system command.
zh_cn: 不必检查 command 是否为一个有效的操作系统命令。

source: It is permissible for the caller to modify the arrays returned by accessors for array-valued enum members; it will have no affect on the arrays returned to other callers.
zh_cn: 调用者可以修改已赋值数组枚举成员的访问器返回的数组；这不会对其他调用者返回的数组产生任何影响。

source: It is possible to create a phantom reference with a null queue, but such a reference is completely useless: Its get method will always return null and, since it does not have a queue, it will never be enqueued.
zh_cn: 可能用一个 null 队列创建虚引用，但这样的引用是完全无用的：其 get 方法将总是返回 null，同时，因为它没有队列，所以将永远无法把它加入队列中。

source: It is possible to define and use other kinds of RejectedExecutionHandler classes.
zh_cn: 定义和使用其他种类的 RejectedExecutionHandler 类也是可能的。

source: It is possible to modify the state of an object so that start() will fail.
zh_cn: 可以修改对象的状态，但这样 start() 将会失败。

source: It is recommended that all subclasses override this method.
zh_cn: 建议所有子类都重写此方法。

source: It is straightforward to define new utility functions that, like getAndIncrement, apply a function to a value atomically.
zh_cn: 很容易定义新的实用程序函数，比如 getAndIncrement，它自动地将函数应用于值。

source: It is strongly recommended (though not required) that natural orderings be consistent with equals.
zh_cn: 建议（虽然不是必需的）最好使自然排序与 equals 一致。

source: It is strongly recommended, but not strictly required that (x.compareTo(y)==0) == (x.equals(y)).
zh_cn: 强烈推荐 (x.compareTo(y)==0) == (x.equals(y)) 这种做法，但并不是 严格要求这样做。

source: It is the responsibility of the program using reference objects to ensure that the objects remain reachable for as long as the program is interested in their referents.
zh_cn: 使用引用对象的程序的责任是，确保对象是可达到的，只要程序对其指示对象感兴趣。

source: It is therefore inappropriate to use arbitrary CharSequence instances as elements in a set or as keys in a map.
zh_cn: 因此，使用任意 CharSequence 实例作为集合中的元素或映射中的键是不合适的。

source: It is through that class that you can check if any of the local interfaces is configured to support IPv6.
zh_cn: 只有通过该类才可以检查是否将所有本地接口都配置为支持 IPv6。

source: It is, however, possible to add to the search path by setting the java.protocol.handler.pkgs system property.
zh_cn: 但是，通过设置 java.protocol.handler.pkgs 系统属性也可能增加搜索路径。

source: It may result in finalizers being called on live objects while other threads are concurrently manipulating those objects, resulting in erratic behavior or deadlock.
zh_cn: 它可能对正在使用的对象调用终结方法，而其他线程同时正在操作这些对象，从而导致不正确的行为或死锁。

source: It preserves the flexibility to change the implementation of the upper layer without changing its API (in particular, the set of exceptions thrown by its methods).
zh_cn: 这种方式保留了改变高层实现而不改变其 API 的灵活性（尤其是，异常集合通过其方法抛出）。

source: It provides the ability to flag a reflected object as suppressing default Java language access control checks when it is used.
zh_cn: 它提供了将反射的对象标记为在使用时取消默认 Java 语言访问控制检查的能力。

source: It then competes in the usual manner with other threads for the right to synchronize on the object; once it has gained control of the object, all its synchronization claims on the object are restored to the status quo ante - that is, to the situation as of the time that the wait method was invoked.
zh_cn: 然后，该线程以常规方式与其他线程竞争，以获得在该对象上同步的权利；一旦获得对该对象的控制权，该对象上的所有其同步声明都将被恢复到以前的状态，这就是调用 wait 方法时的情况。

source: It would be bad design to let the throwable thrown by the lower layer propagate outward, as it is generally unrelated to the abstraction provided by the upper layer.
zh_cn: 让低层抛出的 throwable 向外传播是一种糟糕的设计方法，因为它通常与高层提供的抽象不相关。

source: Iteration over collection views requires time proportional to the "capacity" of the HashMap instance (the number of buckets) plus its size (the number of key-value mappings).
zh_cn: 迭代 collection 视图所需的时间与 HashMap 实例的“容量”（桶的数量）及其大小（键-值映射关系数）成比例。

source: Its functionality has been replaced by java.security.KeyStore, the java.security.cert package, and java.security.Principal.
zh_cn: 其功能已由 java.security.KeyStore 、 java.security.cert 包和 java.security.Principal 所取代。

source: Keep-alive times
zh_cn: 保持活动时间

source: Key factories are used to convert keys (opaque cryptographic keys of type Key) into key specifications (transparent representations of the underlying key material), and vice versa.
zh_cn: 密钥工厂用于将 密钥 （ Key 类型的不透明加密密钥）转换成 密钥规范 （底层密钥材料的透明表示），反之亦然。

source: Key type.
zh_cn: Key 类型。

source: Kills the subprocess.
zh_cn: 杀掉子进程。

source: Known Direct Subclasses
zh_cn: 直接已知子类

source: Known Indirect Subclasses
zh_cn: 已知间接子类

source: Legacy security code; do not use.
zh_cn: 遗留安全代码；不要使用。

source: Let n be the character length of this character sequence (not the length in char values) just prior to execution of the reverse method.
zh_cn: 假设 n 为执行 reverse 方法前此字符序列的字符长度（并非 char 值的长度），

source: Let n be the length of the old character sequence, the one contained in the StringBuffer just prior to execution of the append method.
zh_cn: 在执行 append 方法前，让 StringBuffer 中包含的原有字符序列的长度为 n。

source: Let n be the length of this character sequence just prior to execution of the append method.
zh_cn: 假设此字符序列的长度在执行 append 方法前为 n。

source: LinkedHashMap support
zh_cn: LinkedHashMap 支持

source: Links the specified class.
zh_cn: 链接指定的类。

source: Lists (and arrays) of objects that implement this interface can be sorted automatically by Collections.sort (and Arrays.sort).
zh_cn: 实现此接口的对象列表（和数组）可以通过 Collections.sort（和 Arrays.sort）进行自动排序。

source: Loads a code file with the specified filename from the local file system as a dynamic library.
zh_cn: 从作为动态库的本地文件系统中以指定的文件名加载代码文件。

source: Loads the class with the specified binary name.
zh_cn: 使用指定的二进制名称来加载类。

source: Loads the dynamic library with the specified library name.
zh_cn: 加载具有指定库名的动态库。

source: Loads the specified filename as a dynamic library.
zh_cn: 加载作为动态库的指定文件名。

source: Loads the system library specified by the libname argument.
zh_cn: 加载由 libname 参数指定的系统库。

source: Local variable declaration
zh_cn: 局部变量声明

source: LruCache has an effective eviction policy and lets the user tune how much memory is allotted.
zh_cn: LruCache 有一个有效的逐出策略，允许用户调整分配了多少内存。

source: MUST be a power of two <= 1<<30.
zh_cn: 必须是 2 的幂，<= 1<<30。

source: Many of the classes provided in this package (the cryptographic and secure random number generator classes in particular) are provider-based.
zh_cn: 此包中提供的许多类（特别是密码和安全随机数生成器类）是基于提供商的。

source: Many uses of stop should be replaced by code that simply modifies some variable to indicate that the target thread should stop running.
zh_cn: 许多使用 stop 的代码应该被简单地修改一些变量以指示目标线程应该停止运行的代码所替代。

source: Maps a library name into a platform-specific string representing a native library.
zh_cn: 将一个库名称映射到特定于平台的、表示本机库的字符串中。

source: Marker interface used by List implementations to indicate that they support fast (generally constant time) random access.
zh_cn: List 实现所使用的标记接口，用来表明其支持快速（通常是固定时间）随机访问。

source: Marks this thread as either a daemon thread or a user thread.
zh_cn: 将该线程标记为 守护 线程或用户线程。

source: Maximum exponent a finite double variable may have.
zh_cn: 有限 double 变量可能具有的最大指数。

source: Maximum exponent a finite float variable may have.
zh_cn: 有限 float 变量可能具有的最大指数。

source: Member is an interface that reflects identifying information about a single member (a field or a method) or a constructor.
zh_cn: 成员是一种接口，反映有关单个成员（字段或方法）或构造方法的标识信息。

source: Memory Consistency Properties
zh_cn: 内存一致性属性

source: Method getQueue() allows access to the work queue for purposes of monitoring and debugging.
zh_cn: 方法 getQueue() 允许出于监控和调试目的而访问工作队列。

source: Method declaration
zh_cn: 方法声明

source: Method invoked prior to executing the given Runnable in the given thread.
zh_cn: 在执行给定线程中的给定 Runnable 之前调用的方法。

source: Method invoked upon completion of execution of the given Runnable.
zh_cn: 基于完成执行给定 Runnable 所调用的方法。

source: Method invoked when the Executor has terminated.
zh_cn: 当 Executor 已经终止时调用的方法。

source: Method invoked when the given thread terminates due to the given uncaught exception.
zh_cn: 当给定线程因给定的未捕获异常而终止时，调用该方法。

source: Method's declaring class
zh_cn: 方法的声明类

source: Methods Duplicated in Multiple Proxy Interfaces
zh_cn: 在多代理接口中重复的方法

source: Methods to access the character-based console device, if any, associated with the current Java virtual machine.
zh_cn: 此类包含多个方法，可访问与当前 Java 虚拟机关联的基于字符的控制台设备（如果有）。

source: Minimum exponent a normalized double variable may have.
zh_cn: 标准化 double 变量可能具有的最小指数。

source: Minimum exponent a normalized float variable may have.
zh_cn: 标准化 float 变量可能具有的最小指数。

source: Modifying a process builder's attributes will affect processes subsequently started by that object's start() method, but will never affect previously started processes or the Java process itself.
zh_cn: 修改进程构建器的属性将影响后续由该对象的 start() 方法启动的进程，但从不会影响以前启动的进程或 Java 自身的进程。

source: More formally, if this map contains a mapping from a key k to a value v such that (key==null ?
zh_cn: 更确切地讲，如果此映射包含一个从 k 键到 v 值的映射关系满足 (key==null ?

source: More information about annotation types can be found in section 9.6 of The Java™ Language Specification.
zh_cn: 关于注释类型的更多信息可以在 The Java™ Language Specification 9.6 节中找到。

source: More information about enums, including descriptions of the implicitly declared methods synthesized by the compiler, can be found in section 8.9 of The Java™ Language Specification.
zh_cn: 有关枚举的更多信息，包括编译器合成的隐式声明方法的描述，可以在 The Java™ Language Specification 第 8.9 节中找到。

source: More than one thread may have the same name.
zh_cn: 多个线程可以同名。

source: Most applications should use an android.util.LruCache instead of soft references.
zh_cn: 大多数应用程序应使用 android.util.LruCache 而不是软引用。

source: Most classes in the package contain operations based on time-outs in addition to indefinite waits.
zh_cn: 该包中的大多数类除了包含不确定的等待之外，还包含基于超时的操作。

source: Most concurrent Collection implementations (including most Queues) also differ from the usual java.util conventions in that their Iterators and Spliterators provide weakly consistent rather than fast-fail traversal:
zh_cn: 大多数并发 Collection 实现（包括大多数 Queue）与常规的 java.util 约定也不同，因为它们的 Iterators 和 Spliterators 提供了弱一致的，而不是快速失败的遍历。

source: Most error checking is performed by the start() method.
zh_cn: 大多数错误检查由 start() 方法执行。

source: Most extensions of this class override one or more of the protected hook methods.
zh_cn: 此类的大多数扩展可以重写一个或多个受保护的钩子 (hook) 方法。

source: Most fatally, it doesn't know what to do when given the choice between clearing a soft reference and growing the heap.
zh_cn: 最致命的是，当在清除软引用和增加堆之间做出选择时，它不知道该怎么做。

source: Most internal methods also accept a "tab" argument, that is normally the current table, but may be a new or old one when resizing or converting.
zh_cn: 大多数内部方法也接受一个 “tab” 参数，通常是当前表，但在调整大小或转换时可能是新的或旧的。

source: Most methods try to use normal bins, but relay to TreeNode methods when applicable (simply by checking instanceof a node).
zh_cn: 大多数方法尝试使用普通的 bin，但在适用时会转到 TreeNode 方法(只需要用 instanceof 检查节点)。

source: Most programmers will have no use for this method.
zh_cn: 大多数程序员不会使用此方法。

source: Most subclasses will have no need to override this method, relying solely on the initialValue() method to set the values of thread-locals.
zh_cn: 大部分子类不需要重写此方法，它们只依靠 initialValue() 方法来设置线程局部变量的值。

source: Most such errors are abnormal conditions.
zh_cn: 大多数这样的错误都是异常条件。

source: Most typically, core and maximum pool sizes are set only upon construction, but they may also be changed dynamically using setCorePoolSize(int) and setMaximumPoolSize(int).
zh_cn: 在大多数情况下，核心和最大池大小仅基于构造来设置，不过也可以使用 setCorePoolSize(int) 和 setMaximumPoolSize(int) 进行动态更改。

source: Multiple objects may be instantiated at run-time to represent a given type variable.
zh_cn: 可以在运行时将多个对象实例化，以表示一个给定的类型变量。

source: Nearly all other internal methods are also package-protected but are declared final, so can be used by LinkedHashMap, view classes, and HashSet.
zh_cn: 几乎所有其他的内部方法也被封装保护，但被声明为 final，因此可以被 LinkedHashMap，视图类和 HashSet 使用。

source: Neutral bidirectional character type "B" in the Unicode specification.
zh_cn: Unicode 规范中的非特定双向字符类型“B”。

source: Neutral bidirectional character type "ON" in the Unicode specification.
zh_cn: Unicode 规范中的非特定双向字符类型“ON”。

source: Neutral bidirectional character type "S" in the Unicode specification.
zh_cn: Unicode 规范中的非特定双向字符类型“S”。

source: Neutral bidirectional character type "WS" in the Unicode specification.
zh_cn: Unicode 规范中的非特定双向字符类型“WS”。

source: Nevertheless, the map is implemented in such a way that environment variables which are not modified by Java code will have an unmodified native representation in the subprocess.
zh_cn: 此外，映射以这种方式实现：不能由 Java 代码修改的环境变量在子进程中将有一个不可修改的本机表示形式。
